Revit 2027 API
Frame.Transform Method
 Applies the input transform to this frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Transform(
	Transform trf
)
Public Sub Transform (
	trf As Transform
)
public:
void Transform(
	Transform^ trf
)
member Transform :
        trf : Transform -> unit
Parameters
trf Transform
 The transform to apply to the frame.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace